[
  {
    "categoria": "Standard",
    "domanda": "Voglio una user story per resettare la password dimenticata tramite email.",
    "risposta_ideale": "Come utente, voglio poter avviare la procedura di reset della password dalla pagina di login e ricevere un link via email, così da poter riottenere l'accesso al mio account in modo sicuro."
  },
  {
    "categoria": "Standard",
    "domanda": "Crea una user story per la ricerca di prodotti tramite filtri di prezzo e categoria.",
    "risposta_ideale": "Come cliente, voglio poter filtrare i prodotti per categoria e specificare una fascia di prezzo, così da visualizzare solo gli articoli che mi interessano e che rientrano nel mio budget."
  },
  {
    "categoria": "Standard",
    "domanda": "L'utente deve poter caricare un'immagine per il suo profilo.",
    "risposta_ideale": "Come utente, voglio poter caricare una nuova immagine del profilo dalla pagina delle impostazioni, così da personalizzare il mio account e rendermi riconoscibile."
  },
  {
    "categoria": "Standard",
    "domanda": "Voglio poter salvare un prodotto nella mia wishlist.",
    "risposta_ideale": "Come utente registrato, voglio poter aggiungere un prodotto alla mia wishlist da una pagina prodotto, così da poterlo ritrovare e acquistare in un secondo momento."
  },
  {
    "categoria": "Standard",
    "domanda": "L'utente deve poter scrivere una recensione per un prodotto acquistato.",
    "risposta_ideale": "Come cliente, voglio poter lasciare una valutazione a stelle e un commento testuale per un prodotto che ho acquistato, così da condividere la mia opinione con altri utenti."
  },
  {
    "categoria": "Complessa",
    "domanda": "L'utente admin deve poter vedere la lista degli ordini, filtrarli per data e stato (in attesa, spedito, cancellato), e esportare i risultati in CSV.",
    "risposta_ideale": "Come amministratore, voglio poter visualizzare e filtrare la lista di tutti gli ordini per intervallo di date e per stato, e poter esportare la vista corrente in un file CSV, così da poter analizzare i dati di vendita e gestire le operazioni."
  },
  {
    "categoria": "Complessa",
    "domanda": "Nel carrello, l'utente deve poter modificare la quantità di un prodotto, rimuoverlo e vedere il subtotale aggiornarsi in tempo reale.",
    "risposta_ideale": "Come cliente, voglio poter modificare la quantità di ogni articolo o rimuoverlo dal mio carrello, vedendo il costo totale aggiornarsi istantaneamente, così da avere il pieno controllo sul mio ordine prima del checkout."
  },
  {
    "categoria": "Complessa",
    "domanda": "Voglio un sistema di notifiche che avvisi l'utente via email e con una notifica in-app quando un prodotto della sua wishlist torna disponibile.",
    "risposta_ideale": "Come utente, voglio ricevere una notifica via email e una all'interno dell'app quando un prodotto che ho salvato nella mia wishlist torna disponibile, così da non perdere l'opportunità di acquistarlo."
  },
  {
    "categoria": "Complessa",
    "domanda": "Durante il checkout, l'utente deve poter scegliere tra spedizione standard e spedizione express, vedendo i costi e le date di consegna stimate per entrambe.",
    "risposta_ideale": "Come cliente, voglio poter scegliere tra diverse opzioni di spedizione durante il checkout, visualizzando chiaramente i costi e le date di consegna stimate per ciascuna, così da poter selezionare quella che meglio si adatta alle mie esigenze."
  },
  {
    "categoria": "Complessa",
    "domanda": "L'utente deve poter applicare un codice sconto nel carrello e vedere il totale ricalcolato prima di procedere al pagamento.",
    "risposta_ideale": "Come acquirente, voglio poter inserire un codice promozionale nel mio carrello, così che il totale dell'ordine venga ricalcolato per riflettere lo sconto prima che io proceda al pagamento."
  },
  {
    "categoria": "Ambigua",
    "domanda": "Dobbiamo rendere la dashboard più utile.",
    "risposta_ideale": "Come utente, voglio visualizzare un riepilogo dei miei ordini recenti, lo stato delle mie spedizioni e delle scorciatoie alle sezioni più importanti direttamente sulla dashboard, così da avere una panoramica immediata delle mie attività."
  },
  {
    "categoria": "Ambigua",
    "domanda": "Semplifichiamo la registrazione.",
    "risposta_ideale": "Come nuovo utente, voglio poter completare la registrazione fornendo solo email e password, senza dover compilare campi non essenziali, così da creare un account nel minor tempo possibile."
  },
  {
    "categoria": "Ambigua",
    "domanda": "Bisogna gestire meglio i resi.",
    "risposta_ideale": "Come cliente, voglio poter avviare una richiesta di reso per un ordine direttamente dalla mia cronologia acquisti e stampare l'etichetta di spedizione, così da rendere il processo di restituzione più semplice e autonomo."
  },
  {
    "categoria": "Ambigua",
    "domanda": "La ricerca deve funzionare meglio.",
    "risposta_ideale": "Come utente, voglio che la barra di ricerca mi suggerisca automaticamente i prodotti mentre digito, così da trovare più velocemente quello che cerco."
  },
  {
    "categoria": "Zero-Shot",
    "domanda": "Voglio una user story per un'app di giardinaggio che notifichi quando innaffiare le piante in base al meteo locale.",
    "risposta_ideale": "Come appassionato di giardinaggio, voglio ricevere notifiche intelligenti che mi ricordino quando innaffiare le piante, tenendo conto delle previsioni meteo locali per evitare di bagnarle eccessivamente, così da mantenerle sane e ottimizzare il consumo d'acqua."
  },
  {
    "categoria": "Zero-Shot",
    "domanda": "Crea una user story per una piattaforma di e-learning che permetta agli studenti di fare domande anonime durante una lezione live.",
    "risposta_ideale": "Come studente, voglio poter inviare domande in modo anonimo durante una lezione dal vivo, così da poter chiarire i miei dubbi senza sentirmi a disagio o timido."
  },
  {
    "categoria": "Zero-Shot",
    "domanda": "L'admin di un hotel deve poter modificare la disponibilità delle camere per un certo periodo a causa di lavori di manutenzione.",
    "risposta_ideale": "Come gestore dell'hotel, voglio poter bloccare la disponibilità di una o più camere per un intervallo di date specifico, indicando la manutenzione come motivo, così da evitare prenotazioni accidentali durante i lavori."
  },
  {
    "categoria": "Zero-Shot",
    "domanda": "Voglio una user story per un'app di carpooling che permetta ai passeggeri di vedere il rating del guidatore prima di prenotare.",
    "risposta_ideale": "Come passeggero, voglio poter visualizzare il rating medio e le recensioni di un guidatore prima di confermare la mia richiesta di passaggio, così da poter scegliere un viaggio sicuro e affidabile."
  },
  {
    "categoria": "Zero-Shot",
    "domanda": "Un utente di un'app di ricette deve poter adattare le dosi di una ricetta in base al numero di persone.",
    "risposta_ideale": "Come cuoco, voglio poter inserire il numero di porzioni desiderate e vedere le quantità degli ingredienti di una ricetta ricalcolarsi automaticamente, così da poter preparare il piatto per un numero diverso di persone senza fare calcoli manuali."
  },
  {
    "categoria": "Zero-Shot",
    "domanda": "Un utente di un'app di fitness deve poter registrare un allenamento inserendo esercizi, serie, ripetizioni e peso.",
    "risposta_ideale": "Come atleta, voglio poter registrare i dettagli dei miei allenamenti, specificando per ogni esercizio il numero di serie, le ripetizioni e il peso utilizzato, così da poter monitorare i miei progressi nel tempo."
  },
  {
    "categoria": "Multi-Story",
    "domanda": "L'utente deve potersi registrare, fare il login e, una volta autenticato, deve poter modificare il proprio profilo, cambiando nome e immagine.",
    "risposta_ideale": "Come nuovo utente, voglio potermi registrare al servizio fornendo email e password, così da creare un account personale.\nCome utente registrato, voglio poter accedere al mio account inserendo le mie credenziali, così da utilizzare le funzionalità del servizio.\nCome utente autenticato, voglio poter modificare il mio nome e la mia immagine del profilo, così da mantenere le mie informazioni aggiornate e personalizzate."
  },
  {
    "categoria": "Multi-Story",
    "domanda": "L'amministratore del sito deve poter creare un nuovo articolo del blog, modificarlo in seguito e infine eliminarlo. Deve anche poter vedere la lista di tutti gli articoli.",
    "risposta_ideale": "Come amministratore, voglio poter creare un nuovo articolo inserendo titolo, testo e immagine di copertina, così da pubblicare nuovi contenuti sul blog.\nCome amministratore, voglio poter modificare il contenuto di un articolo esistente, così da correggere errori o aggiornare le informazioni.\nCome amministratore, voglio poter eliminare un articolo obsoleto, così da mantenere pulito l'archivio dei contenuti.\nCome amministratore, voglio poter visualizzare una lista di tutti gli articoli pubblicati con la loro data di creazione, così da avere una visione d'insieme dei contenuti."
  },
  {
    "categoria": "Multi-Story",
    "domanda": "Durante il processo di checkout, l'utente deve poter inserire un indirizzo di spedizione, specificare un indirizzo di fatturazione diverso se necessario, e aggiungere i dati della sua carta di credito per il pagamento.",
    "risposta_ideale": "Come cliente, voglio poter inserire e salvare un nuovo indirizzo di spedizione durante il checkout, così da ricevere il mio ordine dove preferisco.\nCome cliente, voglio poter specificare un indirizzo di fatturazione diverso da quello di spedizione, così da gestire correttamente la contabilità dei miei acquisti.\nCome cliente, voglio poter inserire in modo sicuro i dati della mia carta di credito per completare il pagamento, così da finalizzare l'ordine."
  },
  {
    "categoria": "Multi-Story",
    "domanda": "Voglio creare un nuovo post su un social network. Devo poter scrivere del testo, caricare una foto dal mio dispositivo e menzionare alcuni amici nel post.",
    "risposta_ideale": "Come utente, voglio poter scrivere un contenuto testuale per un nuovo post, così da condividere i miei pensieri.\nCome utente, voglio poter caricare una foto dal mio computer o smartphone da allegare al post, così da arricchire il mio contenuto visivamente.\nCome utente, voglio poter menzionare i miei amici nel testo del post, così da coinvolgerli e notificare loro la mia pubblicazione."
  },
  {
    "categoria": "Multi-Story",
    "domanda": "Come capo progetto, ho bisogno di poter creare una nuova attività in bacheca, assegnarla a un membro del team e impostare una data di scadenza.",
    "risposta_ideale": "Come capo progetto, voglio poter creare una nuova attività specificando un titolo e una descrizione, così da definire il lavoro da svolgere.\nCome capo progetto, voglio poter assegnare un'attività a un membro specifico del team, così da chiarire le responsabilità.\nCome capo progetto, voglio poter impostare una data di scadenza per un'attività, così da comunicare le tempistiche e monitorare l'avanzamento."
  }
]